{"id":"paper_1702500000000","title":"Attention Is All You Need","authors":"Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N. Gomez, Lukasz Kaiser, Illia Polosukhin","journal":"NeurIPS","year":"2017","doi":"10.5555/3295222.3295349","url":"https://arxiv.org/abs/1706.03762","keyAssumptions":"RNNs and CNNs are necessary for sequence transduction; Sequential computation limits parallelization","citation":"Vaswani, A., Shazeer, N., Parmar, N., Uszkoreit, J., Jones, L., Gomez, A. N., ... & Polosukhin, I. (2017). Attention is all you need. Advances in neural information processing systems, 30.","notes":"Foundational paper introducing the Transformer architecture. Key innovation: self-attention mechanism allows modeling dependencies without recurrence or convolution.","addedDate":"2024-01-15T10:00:00Z"}
{"id":"paper_1702500000001","title":"BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding","authors":"Jacob Devlin, Ming-Wei Chang, Kenton Lee, Kristina Toutanova","journal":"NAACL","year":"2019","doi":"10.18653/v1/N19-1423","url":"https://arxiv.org/abs/1810.04805","keyAssumptions":"Unidirectional language models are sufficient for pre-training; Fine-tuning requires task-specific architectures","citation":"Devlin, J., Chang, M. W., Lee, K., & Toutanova, K. (2019). BERT: Pre-training of deep bidirectional transformers for language understanding. In Proceedings of NAACL-HLT (pp. 4171-4186).","notes":"Introduces bidirectional pre-training using masked language modeling. Shows that deep bidirectional representations significantly improve downstream task performance.","addedDate":"2024-01-15T10:05:00Z"}
{"id":"paper_2025050000000","title":"Robin: A multi-agent system for automating scientific discovery","authors":"Ali Essam Ghareeb, Benjamin Chang, Ludovico Mitchener, Angela Yiu, Caralyn J. Szostkiewicz, Jon M. Laurent, Muhammed T. Razzak, Andrew D. White, Michaela M. Hinks, Samuel G. Rodriques","journal":"arXiv","year":"2025","doi":"10.48550/arXiv.2505.13400","url":"https://arxiv.org/abs/2505.13400","keyAssumptions":"Individual research components must be automated separately; Full research integration is not feasible; Human oversight is necessary for meaningful insights","citation":"Ghareeb, A. E., Chang, B., Mitchener, L., Yiu, A., Szostkiewicz, C. J., Laurent, J. M., ... & Rodriques, S. G. (2025). Robin: A multi-agent system for automating scientific discovery. arXiv preprint arXiv:2505.13400.","notes":"First multi-agent system to achieve end-to-end scientific discovery with real-world validation. Identified ripasudil as novel dAMD therapeutic candidate through coordinated literature search, hypothesis generation, and data analysis agents.","addedDate":"2025-08-08T00:35:00Z"}
{"id":"paper_2024080000000","title":"The AI Scientist: Towards Fully Automated Open-Ended Scientific Discovery","authors":"Chris Lu, Cong Lu, Robert Tjarko Lange, Jakob Foerster, Jeff Clune, David Ha","journal":"arXiv","year":"2024","doi":"10.48550/arXiv.2408.06292","url":"https://arxiv.org/abs/2408.06292","keyAssumptions":"Scientific research requires human creativity and intuition; Automated systems can only assist with sub-tasks; End-to-end automation is not feasible","citation":"Lu, C., Lu, C., Lange, R. T., Foerster, J., Clune, J., & Ha, D. (2024). The AI Scientist: Towards Fully Automated Open-Ended Scientific Discovery. arXiv preprint arXiv:2408.06292.","notes":"First comprehensive framework for fully automated scientific workflow including idea generation, implementation, experimentation, analysis, and paper writing. Demonstrated generation of papers exceeding conference acceptance thresholds at ~$15 per paper.","addedDate":"2025-08-08T00:35:00Z"}
{"id":"paper_2025040000000","title":"The AI Scientist-v2: Workshop-Level Automated Scientific Discovery via Agentic Tree Search","authors":"Yutaro Yamada, Robert Tjarko Lange, Cong Lu, Shengran Hu, Chris Lu, Jakob Foerster, Jeff Clune, David Ha","journal":"arXiv","year":"2025","doi":"10.48550/arXiv.2504.08066","url":"https://arxiv.org/abs/2504.08066","keyAssumptions":"Automated research systems require extensive human-provided scaffolding; Domain-specific customization is necessary for effective operation","citation":"Yamada, Y., Lange, R. T., Lu, C., Hu, S., Lu, C., Foerster, J., Clune, J., & Ha, D. (2025). The AI Scientist-v2: Workshop-Level Automated Scientific Discovery via Agentic Tree Search. arXiv preprint arXiv:2504.08066.","notes":"Enhanced AI research system achieving first peer-reviewed AI-generated paper acceptance at ICLR workshop. Eliminated reliance on human templates through progressive agentic tree-search methodology.","addedDate":"2025-08-08T00:35:00Z"}
{"id":"paper_2025030000000","title":"Agentic AI for Scientific Discovery: A Survey of Progress, Challenges, and Future Directions","authors":"Mourad Gridach, Jay Nanavati, Khaldoun Zine El Abidine, Lenon Mendes, Christina Mack","journal":"arXiv","year":"2025","doi":"10.48550/arXiv.2503.08979","url":"https://arxiv.org/abs/2503.08979","keyAssumptions":"Agentic AI applications are domain-specific without common principles; No standardized evaluation frameworks exist; Systems operate in isolation","citation":"Gridach, M., Nanavati, J., El Abidine, K. Z., Mendes, L., & Mack, C. (2025). Agentic AI for Scientific Discovery: A Survey of Progress, Challenges, and Future Directions. arXiv preprint arXiv:2503.08979.","notes":"Comprehensive survey establishing taxonomies and evaluation standards for agentic AI in scientific discovery across chemistry, biology, and materials science. Identifies key challenges and future research directions.","addedDate":"2025-08-08T00:35:00Z"}
{"id":"paper_2025080000000","title":"BioDisco: Multi-agent hypothesis generation with dual-mode evidence, iterative feedback and temporal evaluation","authors":"Yujing Ke, Kevin George, Kathan Pandya, Gerrit Großmann, David Blumenthal, Maximilian Sprang, Sebastian Vollmer, David Antony Selby","journal":"arXiv","year":"2025","doi":"10.48550/arXiv.2508.01285","url":"https://arxiv.org/abs/2508.01285","keyAssumptions":"Hypothesis generation can rely primarily on literature synthesis; Structured reasoning processes are not necessary; Systematic uncertainty quantification is not required","citation":"Ke, Y., George, K., Pandya, K., Großmann, G., Blumenthal, D., Sprang, M., Vollmer, S., & Selby, D. A. (2025). BioDisco: Multi-agent hypothesis generation with dual-mode evidence, iterative feedback and temporal evaluation. arXiv preprint arXiv:2508.01285.","notes":"Multi-agent framework combining biomedical knowledge graphs with literature retrieval for evidence-grounded hypothesis generation. Demonstrates superior novelty through iterative feedback and temporal evaluation.","addedDate":"2025-08-08T00:35:00Z"}